app/controllers/comments_controller.rb

        def create
            @post = Post.find(params[:post_id])
             @comment = @post.comments.create(params[:comment].permit(:name, :comment))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["name", "John Doe"], ["comment", "This is a test"], ["created_at", "2023-04-27 23:59:52.246907"], ["updated_at", "2023-04-27 23:59:52.246907"], ["post_id", 5]]